app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    @songs = Song.all

INSERT INTO "songs" ("user_id", "artist", "title", "lyrics", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["artist", "Dispatch"], ["title", "The General"], ["lyrics", "There was a ..."], ["category_id", 1]]
---
  def create
    @song = Song.new(song_params)

    if @song.save

UPDATE "songs" SET "title" = $1, "lyrics" = $2 WHERE "songs"."id" = $3  [["title", "Can't You See"], ["lyrics", "Can't you see, oh, can't you see. What that woman, she been doing to me.\n"], ["id", 19]]
---
  def update
    if @song.update(song_params)

DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 1]]
---
  def destroy
    @song.destroy

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_song
      @song = Song.find(params[:id])