app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "zsucat@test.com"], ["password_digest", "$2a$12$T8IuSGhqH6G8ww//b9KZlO3vh.6a.Hot7bOtiqFB7zRwkhDUYmh9u"], ["updated_at", "2020-05-14 03:35:42.480807"], ["id", 7]]
---
  def update
    if @user.update(user_params)